STRINGS.MOUSE_DRAG = {
	CONTROLS = {
		DRAG = "拖拽",
		COLLECT = "收集",
		COLLECT_MORE = "收集更多",
	},
	RECIPES = {
		NOT_RECNAME = "无上次制作记录",
		NOT_KNOWSRECIPE = "科技未解锁",
		NOT_CANBUILD = "制作材料不足",
	},
	BUTTONS = {
		RANGE = "扫描范围",
		SPACING = "点位间距",
		REMODE = "重复模式",
		PTMODE = "点位模式",
		PICKUP = "自动拾取",
		LINKED = "链接动作",
		FORCE = "强制动作",
		REMOTE = "远程动作",
	},
	OPTIONS = {
		FALSE = "禁用",
		TRUE = "启用",
		ONCE = "单次",
		DEFEAULT = "默认",
		REPEAT = "重复",
		SQUARE = "正方形",
		HEXAGON = "六边形",
	},
	INTRODUCTION = {
		RANGE = "扫描范围的半径。包括快速、双击以及特殊队列，其中快速\n队列以玩家为中心，双击队列与特殊队列以鼠标为中心。",
		SPACING = "执行范围种植/建造时，相邻点位之间的间距。",
		REMODE = "单次：所有对实体动作只执行一次。\n默认：默认逻辑，根据预设判断是否重复执行。\n重复：所有对实体动作重复执行直到无法执行。",
		PTMODE = "正方形点位与六边形点位。其中六边形点位分次种植/建造\n时，每次拖拽必须选择同一原点或水平轴线，否则坐标无法\n对应上旧批次。",
		PICKUP = "所有对实体动作以及铲地皮动作完成后，自动拾取一定范围\n内的掉落物。",
		LINKED = "目前有砍伐完成后，自动装备铲子并挖掉对应树桩的功能；\n自动翻脚印/气泡无需启用该功能也可执行。",
		FORCE = "推送动作无视玩家当前状态。动作可打断前一动作的后摇，\n即动作执行变快；打断玩家的冰冻、黏住等状态，即解控。\n但当使用伍迪砍树也会打断其变身状态，此时需禁用。",
		REMOTE = "执行动作无需靠近实体或位置，可以直接在原地远程执行完\n所有动作。",
	}
}